/*1. 查询出部门编号为30的所有员工*/
/*
分析：
1). 列：没有说明要查询的列，所以查询所有列
2). 表：只一张表，emp
3). 条件：部门编号为30，即deptno=30
*/
SELECT * FROM emp WHERE deptno=30;

/**********************************************/

/*2. 所有销售员的姓名、编号和部门编号。*/
/*
分析：
列：姓名ename、编号empno、部门编号deptno
表：emp
条件：所有销售员，即job='销售员'
*/
SELECT ename,empno,deptno FROM emp WHERE job='销售员'

/**********************************************/

/*3. 找出奖金高于工资的员工。*/
/*
分析：
列：所有列
表：emp
条件：奖金>工资，即comm>sal
*/
SELECT * FROM emp WHERE comm>sal;

/**********************************************/

/*4. 找出奖金高于工资60%的员工。*/
/*
分析：
列：所有列
表：emp
条件：奖金>工资*0.6，即comm>sal*0.6
*/
SELECT * FROM emp WHERE comm>sal*0.6;

/**********************************************/

/*5. 找出部门编号为10中所有经理，和部门编号为20中所有销售员的详细资料。*/
/*
分析：
列：所有列
表：emp
条件：部门编号=10并且job为经理，和部门编号=20并且job为销售员
*/
SELECT * FROM emp WHERE (deptno=10 AND job='经理') OR (deptno=20 AND job='销售员');

/**********************************************/

/*6. 找出部门编号为10中所有经理，部门编号为20中所有销售员，还有即不是经理又不是销售员但其工资大或等于20000的所有员工详细资料。*/
/*
分析：
列：所有列
表：emp
条件：deptno=10 and job='经理', depnto=20 and job='销售员', job not in ('销售员','经理') and sal>=20000
*/

SELECT * FROM emp 
WHERE 
  (deptno=10 AND job='经理') 
  OR (deptno=20 AND job='销售员') 
  OR job NOT IN ('经理','销售员') AND sal>=20000;

/**********************************************/

/*7. 有奖金的工种。*/
/*
列：工作(不能重复出现)
表：emp
条件：comm is not null
*/
SELECT DISTINCT job FROM emp WHERE comm IS NOT NULL;

/**********************************************/

/*8. 无奖金或奖金低于1000的员工。*/
/*
分析：
列：所有列
表：emp
条件：comm is null 或者 comm < 1000
*/

SELECT * FROM emp WHERE comm IS NULL OR comm < 1000;

/**********************************************/

/*9. 查询名字由三个字组成的员工。*/
/*
分析：
列：所有
表：emp
条件：ename like '___'
*/
SELECT * FROM emp WHERE ename LIKE '___'

/**********************************************/

/*10.查询2000年入职的员工。*/
/*
分析：
列：所有
表：emp
条件：hiredate like '2000%'
*/
SELECT * FROM emp WHERE hiredate LIKE '2000%';

/**********************************************/

/*11. 查询所有员工详细信息，用编号升序排序*/
/*
分析；
列：所有
表：emp
条件：无
排序：empno asc
*/
SELECT * FROM emp ORDER BY empno ASC;

/**********************************************/

/*12. 查询所有员工详细信息，用工资降序排序，如果工资相同使用入职日期升序排序*/
/*
分析：
列：所有
表：emp
条件：无
排序：sal desc, hiredate asc
*/
SELECT * FROM emp ORDER BY sal DESC, hiredate ASC

/**********************************************/

/*13. 查询每个部门的平均工资*/
/*
分析：
列：部门编号、平均工资(平均工资就是分组信息)
表：emp
条件：无
分组：每个部门，即使用部门分组，平均工资，使用avg()函数
*/
SELECT deptno, AVG(sal) FROM emp GROUP BY deptno;

/**********************************************/

/*14. 求出每个部门的雇员数量。*/
/*
分析：
列：部门编号、人员数量（人员数量即记录数，这是分组信息）
表：emp
条件：无
分组：每个部门是分组信息，人员数量，使用count()函数
*/
SELECT deptno, COUNT(1) FROM emp GROUP BY deptno;

/**********************************************/

/*
15. 查询每种工作的最高工资、最低工资、人数
列：部门、最高工资、最低工资、人数（其中最高工资、最低工资、人数，都是分组信息）
表：emp
条件：无
分组：每种工资是分组信息，最高工资使用max(sal)，最低工资使用min(sal)，人数使用count(*)
*/
SELECT job, MAX(sal), MIN(sal), COUNT(1) FROM emp GROUP BY job;

/**********************************************/

/*16. 显示非销售人员工作名称以及从事同一工作雇员的月工资的总和，并且要满足从事同一工作的雇员的月工资合计大于50000，输出结果按月工资的合计升序排列*/
/*
列：工作名称、工资和(分组信息)
表：emp
条件：无
分组：从事同一工作的工资和，即使用job分组
分组条件：工资合计>50000，这是分组条件，而不是where条件
排序：工资合计排序，即sum(sal) asc
*/
SELECT job,SUM(sal) FROM emp GROUP BY job HAVING SUM(sal)>50000 ORDER BY SUM(sal) ASC;